/* ヒストグラム作成プログラム(10/16課題) */
/* 作成時間 40分程度 */
/* 電子情報工学科内定 340481H 中里徳彦 */
/* 出来上がったヒストグラム */
/*  1 ******                                 */
/*  2 ***********************************    */
/*  3 ************************************** */
/*  4 ********************************       */
/*  5 ****************************           */
/*  6 *********************                  */
/*  7 ****************************           */
/*  8 ******************                     */
/*  9 ************                           */
/* 10 *******                                */
/* 11 *****                                  */
/* 12 ***                                    */
/* 13 *                                      */
/* 14 *                                      */
/* 15 *                                      */
/* 16 *                                      */
/* 17 *                                      */
/* 18 *                                      */
/* 19                                        */
/* 20                                        */


#include <stdio.h>

#define IN 1
#define OUT 0
#define MAXLEN 20
int main() 
{
    int c, state, wl, i, j;
    int nwl[MAXLEN];

    state = IN;
    wl = 0;

    for (i = 0; i < MAXLEN; i++){
        nwl[i] = 0;
    }
    
    while((c = getchar()) != EOF) {
        if (state == IN) {
            if (c == ' ' || c == '\n') {
                nwl[wl]++;
                state = OUT;
                wl = 0;
            } else {
                wl++;
            }
        } else {
            if (c == ' ' || c == '\n') {
            } else {
                state = IN;
                wl = 0;
            }
        }
    }

    for (i = 0; i < MAXLEN; i++) {
        printf("%2d ", i+1);
        j = 0;
        while(j < nwl[i]) {
            printf("*");
            j = j + 100;
        }
        printf("\n");
    }
    return 0;
}

